Documents/ВыплатаКоммерческихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВыплатаКоммерческихРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыплатыКоммерческихРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыплатыКР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлиентМенеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТиповыхЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаКарточку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВыплатыКоммерческихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ВыплатыКоммерческихРасходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлиентМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТиповыхЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВыплатаКоммерческихРасходов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	ДокументВКР = РеквизитФормыВЗначение("Объект");
	ДокументВКР.ВыплатыКР.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКР_Остатки.КлиентМенеджер КАК КлиентМенеджер,
		|	ВКР_Остатки.ВидТЗ КАК ВидТЗ,
		|	СУММА(ВКР_Остатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВыплатыКоммерческихРасходов.Остатки(&ДатаОстатков, ) КАК ВКР_Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКР_Остатки.КлиентМенеджер,
		|	ВКР_Остатки.ВидТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлиентМенеджер,
		|	ВидТЗ";

	
	Запрос.УстановитьПараметр("ДатаОстатков", НачалоМесяца( Объект.Дата ));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Сортировать("КлиентМенеджер");

	ДокументВКР.ВыплатыКР.Загрузить( РезультатЗапроса );
	
	ЗначениеВРеквизитФормы( ДокументВКР, "Объект");
	

КонецПроцедуры
